/**
 * Домашнее задание к занятию 16
 * Каждому нужно создать новую ветку от ветки master. Название ветки должно содержать имя + первая буква фамилии + /lesson16.
 * Например: dmitryR/lesson16. Выполнение задания производится в свое ветке и в этом файле.
 * После выполнения задания делаете пулл реквест и сообщаете о том, что задание выполнено:)
 * В случае неполодок с гитом, присылаете папку с проектом мне в личные сообщения
 * Код решения должен быть сразу же после самого задания
 */

/**
 * Задание 1
 * Добавить в проект GoodWeather даты в ForecastItem(разместить выше максимальной температуры).
 * Добавить к максимальной/минимальной температуре label (MAX/MIN).
 * Добавить время рассвета и заката(разместить ниже минимальной температуры)
 */

/**
 * Задание 2
 * Написать миниприложение строчный календарь. Пример календаря будет в файле calendar.html(только твой должен быть красивее =))
 * По нажатию на кнопки Следующий месяц и Предыдущий месяц должна производится навигация по месяцам.
 * Сегодняшний день должен быть закрашеным. День 8е марта тоже должен быть закращеным каким-нибудь другим цветом.
 */
